## Introduction

#### Our goals today are to be able to: <br/>

- Investigate table data in Pandas
- Manipulate Pandas DataFrames

In [2]:
# list/tuple/dictionary comprehension

list_of_squares = []

for x in range (1,11):
    list_of_squares.append(x**2)

print(list_of_squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [3]:
list_of_squares = [x**2 for x in range (1,11)]
list_of_squares

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [11]:
# tuple comprehension

list_of_squares = (x**2 for x in range (1,11))
list_of_squares

In [13]:
list_of_squares = tuple(x**2 for x in range (1,11))
list_of_squares

(1, 4, 9, 16, 25, 36, 49, 64, 81, 100)

In [16]:
# dictionary comprehension

squares_dict = {x: x**2 for x in range(1,11)}

In [17]:
squares_dict.items()

dict_items([(1, 1), (2, 4), (3, 9), (4, 16), (5, 25), (6, 36), (7, 49), (8, 64), (9, 81), (10, 100)])

In [68]:
[val ** .5 for val in squares_dict.values()]

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]

In [20]:
# with an if statement
list_of_odd_squares = [x**2 for x in range (1,11) if x % 2 == 1]
list_of_odd_squares

[1, 9, 25, 49, 81]

In [69]:
# nested list comprehension
matrix = [[1,2,3],[4,5],[6,7,8,9]]

# nested list comprehension to flatten a given 2-D matrix
flatten_matrix [val for sublist in matrix for val in sublist]
print (flatten_matrix)

SyntaxError: invalid syntax (<ipython-input-69-6255e934acb9>, line 5)

### Activation:

![excel2](img/excelpic2.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

Python
- create documentation of processes as you code
- reduces chances for human error
- do "drag and drop"
- repeatable
- transparent

## Pandas

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [22]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/Users/rociowu/Google Drive/Flatiron/hbs-ds-060120/module-1/day-5-pandas-1
total 56
drwxr-xr-x   6 rociowu  staff    192 Jun  5 10:59 .
drwxr-xr-x   7 rociowu  staff    224 Jun  5 10:33 ..
drwxr-xr-x   3 rociowu  staff     96 Jun  5 10:39 .ipynb_checkpoints
drwxr-xr-x   4 rociowu  staff    128 Jun  5 10:33 data
drwxr-xr-x  12 rociowu  staff    384 Jun  5 10:33 img
-rwxr-xr-x   1 rociowu  staff  26341 Jun  5 10:59 pandas-1.ipynb

In [29]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

In [30]:
cat data/example.csv

cat: data/example.csv: No such file or directory

In [32]:
example_csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

In [33]:
type(example_csv)

pandas.core.frame.DataFrame

In [36]:
type(example_csv['Title3'])
type(example_csv.Title3)

pandas.core.series.Series

In [40]:
example_csv.Title1.values

array(['one', 'example1'], dtype=object)

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [31]:
example_csv.describe()

          Title1    Title2    Title3
count          2         2         2
unique         2         2         2
top     example1  example2  example3
freq           1         1         1

In [41]:
example_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Title1  2 non-null      object
 1   Title2  2 non-null      object
 2   Title3  2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [55]:
# read in your csv here!
muj = pd.read_csv('data/made_up_jobs.csv', index_col='ID')

# remember that it's nice to be able to look at your data, so let's do that here, too.

muj.head()

             Name                       Job  Years Employed
ID
0    Bob Bobberty  Underwater Basket Weaver              13
1    Susan Smells             Salad Spinner               5
2   Alex Lastname      Productivity Manager               2
3         Rudy P.                Being cool              55
4         Rudy G.  Being compared to Rudy P              50

In [43]:
muj['Years Employed'] = muj['Years Employed']astype()

muj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              6 non-null      int64
 1   Name            6 non-null      object
 2   Job             6 non-null      object
 3   Years Employed  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [44]:
pd.DataFrame([[1,2,3],[4,None,6]]) # NaN = Not a Number

   0    1  2
0  1  2.0  3
1  4  NaN  6

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [45]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

In [46]:
[x.lower() for x in fruits] # it doesn't change the dataset

['apple', 'orange', 'watermelon', 'lemon', 'mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [71]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [52]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)
type(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

pandas.core.series.Series

In [53]:
df = pd.DataFrame()

In [54]:
df['Fruits'] = fruits_series

In [65]:
animals = ['Tiger', 'Panda', 'rabbit', 'Bear', 'Squirral']
animals_series = pd.Series(animals, index=ind) # keep the index same to join dataframe
print(animals_series)
type(animals_series)

a       Tiger
b       Panda
c      rabbit
d        Bear
e    Squirral
dtype: object

pandas.core.series.Series

In [66]:
df['animals'] = animals_series

In [67]:
df

       Fruits   animals
a       Apple     Tiger
b      Orange     Panda
c  Watermelon    rabbit
d       Lemon      Bear
e       Mango  Squirral

With a partner, create your own custom series from a list of lists.

In [72]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

elements=[x[0].lower() for x in list_of_lists]

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(elements, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

pandas.core.series.Series

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [75]:
# can create dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

student_dict.values()

dict_values([['Samantha', 'Alex', 'Dante'], ['35', '17', '26'], ['Houston', 'Seattle', 'New york']])

In [76]:
students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [77]:
#to find data types of columns 
students_df.dtypes

name    object
age     object
city    object
dtype: object

In [113]:
# can create dataframe with a dictionary of list or a list of dictionary

student_list = [
    {'name':'Samantha','age':'35', 'city': 'Houston'},
    {'name':'Alex','age':'17', 'city': 'Seattle'},
    {'name':'Dante','age':'26', 'city': 'New York'}
]

student_list_df = pd.DataFrame(student_list)
student_list_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New York

Let's change the data type of ages to int.

In [114]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.astype(int)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
students_df.age = students_df.age.astype(int)

students_df.dtypes

AttributeError: 'DataFrame' object has no attribute 'age'

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [115]:
school_ids = ['1111', '1145', '0096'] # index are helpful to join forms together

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [116]:
students_df.index = students_df.index.rename('id')

In [117]:
students_df

          name age      city
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [118]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.head()

          NAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [119]:
students_df.columns = [x.replace(' ','') for x in students_df.columns] # get rid of spaces in columns
students_df.head()

          NAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [120]:
students_df.rename(columns={"AGE": "YEARS"}, inplace = True) #making the change in place

In [121]:
# Notice what happens when we print students_df

students_df

          NAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [127]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [123]:
# students_df.drop(columns=['YEARS', 'HOME'])
# dropna = dropping any null number

          NAME
id
1111  Samantha
1145      Alex
0096     Dante

In [130]:
students_df.drop(0)

KeyError: '[0] not found in axis'

In [109]:
#Notice again what happens if we print students_df 
students_df

          NAME
id
1111  Samantha
1145      Alex
0096     Dante

In [101]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

          NAME
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [132]:
l = [1, 2, 3, 4, 5]
l = [[0, 5]]

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [133]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [134]:
students_df.loc[:, 'name'] # loc is inclusive on both sides, iloc is inclusive & exclusive

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [135]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [136]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [137]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [138]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [139]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [143]:
# return the last item in the last row using iloc
students_df.iloc[-1, -1]

'New york'

### How would we use `.iloc` to return the last item in the last column?

In [144]:
# return the last item in the last column using iloc
students_df.iloc[-1, -1]

'New york'

### What if we only want certain columns or rows?

In [147]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [156]:
students_df.iloc[[0, 2], [0,2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [157]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [158]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [159]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [160]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [161]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [162]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [163]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [164]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [175]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [176]:
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [177]:
# What should we get now?
students_df.loc[[['5','3'],['name', 'city']]

SyntaxError: unexpected EOF while parsing (<ipython-input-177-47ab9d7cb901>, line 2)

In [171]:
students_df.iloc[0:2] # iloc index position always exists

        name age     city
5   Samantha  35  Houston
11      Alex  17  Seattle

In [185]:
# What should we get now?
students_df.loc['5','3', ['name', 'city']]

IndexingError: Too many indexers

In [179]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [180]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [181]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [182]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [186]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [187]:
# The statement data[name] == Samantha] produces a Pandas Series with a True/False value for every row
# in the data DataFrame, where there are True values for the rows where the name is Samantha.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [188]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [189]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [190]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [192]:
# What should be returned?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia